doc/staff_design_report.md
```mermaid
flowchart TD
    subgraph Nhân viên
        Start8([Bắt đầu]) --> OpenProfile[Truy cập mục Thông tin cá nhân]
    end
    subgraph Hệ thống
        OpenProfile --> RequestProfile[Gửi yêu cầu lấy thông tin cá nhân lên Server]
        RequestProfile --> QueryProfileDB[Truy vấn thông tin người dùng từ bảng User trong CSDL]
        QueryProfileDB --> RenderProfileForm[Trả về dữ liệu tài khoản & Hiển thị thông tin lên Form]
    end
    subgraph Nhân viên
        RenderProfileForm --> WantUpdateProfile{Muốn cập nhật thông tin?}
        WantUpdateProfile -- Không --> EndNoProfileUpdate([Kết thúc])
        WantUpdateProfile -- Có --> EditProfileFields[Chỉnh sửa các trường thông tin]
        EditProfileFields --> ClickSaveProfile[Nhấn nút Lưu Thay Đổi]
    end
    subgraph Hệ thống
        ClickSaveProfile --> SendProfileUpdate[Gửi dữ liệu cập nhật lên Server]
        SendProfileUpdate --> CheckInputs{Họ tên hoặc Số điện thoại trống?}
        CheckInputs -- Có --> ReturnProfileErr[Trả về lỗi dữ liệu không hợp lệ 400] --> ShowProfileErr[Hiển thị Toast báo lỗi]
        CheckInputs -- Không --> UpdateProfileDB[Cập nhật các trường dữ liệu vào bảng User trong CSDL]
        UpdateProfileDB --> ReturnProfileOk[Trả về kết quả cập nhật thành công 200]
        ReturnProfileOk --> RefreshProfileUI[Hiển thị Toast thông báo thành công và cập nhật thông tin mới]
    end
    ShowProfileErr --> EndFail8([Kết thúc thất bại])
    RefreshProfileUI --> EndSuccess8([Kết thúc thành công])
```
